app/views/movies/index.html.erb

    <tr>
      <th id="title_header" class ='<%= @sort_title_css %>'><%= link_to "Movie Title", movies_path({"sort_title"=> true, :ratings=>Hash[@ratings_to_show.map {|v| [v,1]}]}) %></th>
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date