app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'R'  ORDER BY title
---
    def index
      @all_ratings = Movie.all_ratings
      if params[:ratings] == nil && params[:sort_release] == nil && params[:sort_title] == nil
        if session.keys != nil
          params[:ratings] = session[:ratings]
          params[:sort_release] = session[:sort_release]
          params[:sort_title] = session[:sort_title]
        end
      else
        session[:ratings] = params[:ratings]
        session[:sort_release] = params[:sort_release]
        session[:sort_title] = params[:sort_title]
      end
      if params[:ratings] != nil
        @ratings_to_show = params[:ratings].keys
      else
        @ratings_to_show = Movie.all_ratings
      end
      @movies = Movie.with_ratings(@ratings_to_show)
      if params[:sort_release] != nil
        @movies = @movies.order("release_date")
        @sort_release_css = "hilite bg-warning"
      end
      if params[:sort_title] != nil
        @movies = @movies.order("title")